{"HISTORY":"New tag introduced in ColdFusion 9.<br>","SYNTAX":"<i xmlns:fn=\"http:\/\/www.w3.org\/2005\/xpath-functions\" xmlns:fo=\"http:\/\/www.w3.org\/1999\/XSL\/Format\" xmlns:xs=\"http:\/\/www.w3.org\/2001\/XMLSchema\">&lt;cfimap<\/i><i xmlns:fn=\"http:\/\/www.w3.org\/2005\/xpath-functions\" xmlns:fo=\"http:\/\/www.w3.org\/1999\/XSL\/Format\" xmlns:xs=\"http:\/\/www.w3.org\/2001\/XMLSchema\"> \r\n &nbsp;action =&quot;DELETE|DELETEFOLDER|CREATEFOLDER|OPEN|CLOSE|RENAMEFOLDER|LISTALLFOLDERS| MARKREAD|MOVEMAIL|GETALL|GETHEADERONLY&quot;<\/i>     \r\n&nbsp; attachmentpath = &quot;string&quot; <i xmlns:fn=\"http:\/\/www.w3.org\/2005\/xpath-functions\" xmlns:fo=\"http:\/\/www.w3.org\/1999\/XSL\/Format\" xmlns:xs=\"http:\/\/www.w3.org\/2001\/XMLSchema\"> \r\n&nbsp;&nbsp;connection = &quot;string&quot; \r\n&nbsp;&nbsp;folder = &quot;string&quot; \r\n&nbsp;&nbsp;generateuniquefilenames = &quot;yes|no&quot; \r\n&nbsp;&nbsp;maxrows = &quot;integer&quot; \r\n&nbsp;&nbsp;messagenumber =&quot;integer&quot; \r\n&nbsp;&nbsp;name = &quot;string&quot; \r\n&nbsp;&nbsp;newfolder = &quot;string&quot;<i> &nbsp;&nbsp;<\/i>password = &quot;string&quot; \r\n&nbsp;&nbsp;port = &quot;integer&quot; \r\n&nbsp;&nbsp;recurse = &quot;true|false&quot; \r\n&nbsp;&nbsp;secure = &quot;yes|no&quot;  \r\n&nbsp;&nbsp;server = &quot;IMAP server address&quot; \r\n&nbsp;&nbsp;startrow = &quot;integer&quot;<i> &nbsp;&nbsp;secure = &quot;yes|no&quot; &nbsp;&nbsp;<\/i>stoponerror = &quot;true|false&quot; \r\n&nbsp;&nbsp;uid = &quot;integer or comma-delimited list of integers&quot; \r\n&nbsp;&nbsp;username = &quot;SMTP user ID&quot;&gt;<\/i><br>","CATEGORY":"Communications tags, Internet protocol tags","PAGENAME":"cfimap","SEEALSO":"<samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7c15.html\">cfmailparam<\/a><\/samp>, <samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7c15.html\">cfmailparam<\/a><\/samp>, <samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7c14.html\">cfmailpart<\/a><\/samp>, <samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7f96.html\">cfpop<\/a><\/samp>, <samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7c7d.html\">cfftp<\/a><\/samp>, <samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7ffc.html\">cfhttp<\/a><\/samp>, <samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7f97.html\">cfldap<\/a><\/samp>, <samp class=\"codeph\"><a href=\"WSc3ff6d0ea77859461172e0811cbec22c24-7114.html\">Wrap<\/a><\/samp>; <a href=\"http:\/\/help.adobe.com\/en_US\/ColdFusion\/9.0\/Developing\/WSc3ff6d0ea77859461172e0811cbec22c24-70fc.html\" target=\"_self\">Using ColdFusion with mail servers<\/a> in <a href=\"http:\/\/help.adobe.com\/en_US\/ColdFusion\/9.0\/Developing\/WSc3ff6d0ea77859461172e0811cbec22c24-782a.html\" target=\"_self\">Sending and Receiving E-Mail<\/a> in the <i xmlns:fn=\"http:\/\/www.w3.org\/2005\/xpath-functions\" xmlns:fo=\"http:\/\/www.w3.org\/1999\/XSL\/Format\" xmlns:xs=\"http:\/\/www.w3.org\/2001\/XMLSchema\">Developing ColdFusion Applications<\/i><br>","DESCRIPTION":"Queries an IMAP server to retrieve and manage mails within multiple folders.","LICENCE":"http:\/\/help.adobe.com\/en_US\/ColdFusion\/10.0\/LegalNotices\/index.html","EXAMPLE":"&lt;!--- Retrieving e-mails from a folder ---&gt; \r\n&lt;html &gt; \r\n    &lt;head&gt; \r\n    &lt;title&gt;IMAP Mail Client&lt;\/title&gt; \r\n    &lt;\/head&gt; \r\n    &lt;body&gt; \r\n    &lt;!--- Replace your username and password with valid IMAP email account name and password. Replace &quot;server address&quot; with your IMAP server address---&gt; \r\n    &lt;cfimap \r\n        server = &quot;server address&quot; &lt;!------&gt; \r\n        username = &quot;yourname&quot; \r\n        action=&quot;open&quot; \r\n        secure=&quot;yes&quot; \r\n        password = &quot;yourpassword&quot; \r\n        connection = &quot;test.cf.gmail&quot;&gt; \r\n    &lt;!--- Retrieve header information from the mailbox. ---&gt; \r\n    &lt;cfimap \r\n        action=&quot;getHeaderOnly&quot; \r\n        connection=&quot;test.cf.gmail&quot; \r\n        name=&quot;queryname&quot;&gt; \r\n    &lt;cfdump var=&quot;#queryname#&quot;&gt; \r\n    &lt;cfimap \r\n        action=&quot;close&quot; \r\n        connection = &quot;test.cf.gmail&quot;&gt; \r\n    &lt;\/body&gt; \r\n&lt;\/html&gt;<br>","USAGE":"Open a session or connection with an IMAP server. To open a session, define the server, user name, and password attributes. You can open a connection with an IMAP server by specifying values for the server, user name, password, and connection attributes. For a secure connection, specify secure=&quot;true&quot;. You can reuse the connection attribute in subsequent CFIMAP tags, without having to specify the server, user name, or password attributes. Once you have established a connection, you can perform the following actions:<br><li><p>Retrieve mail: Retrieve mail using the GetHeaderOnly or GetAll attributes and store the information in a query object. Use the cfdump command to display the content of the query object. You can also download attachments in temporary ColdFusion folder or a new folder as defined by the AttachmentPath attribute.<\/p> <\/li> \n<li><p>Delete any unnecessary mail or delete folders. You can delete any user-created folders. Standard folders, such as INBOX, OUTBOX, SEND, cannot be deleted.<\/p> <\/li> \n<li><p>Mark multiple mail as read.<\/p> <\/li> \n<li><p>Manage mail folders by creating folders, renaming them or moving mail across folders. If you are using sub folders, then use periods (.) to specify the exact path.<\/p> <\/li><br>Once you have performed all actions, close the session or connection with the IMAP server. For example, mail from your e-mail account in Gmail can be retrieved by setting a connection to the Gmail IMAP server. You can define the login (user name) and set a secure connection. Next, you can quickly retrieve a top-level snapshot of e-mails using the GetHeaderOnly attribute or access full information about e-mails using the GetAll attribute. \n<div class=\"note\">\n <span class=\"notetitle\">Note: <\/span>Gmail is not a complete IMAP implementation so some of the features of a regular IMAP server may not work with Gmail.\n<\/div><br>The following table lists the query information (column names) returned by various cfimap attributes.<br><div class=\"tablenoborder\">\n <table border=\"1\" cellpadding=\"4\" cellspacing=\"0\">\n  <thead align=\"left\">\n   <tr>\n    <th valign=\"top\" width=\"NaN%\" id=\"d17e52145\"><p>Values for “action” attribute<\/p> <\/th> \n    <th valign=\"top\" width=\"NaN%\" id=\"d17e52148\"><p>Columns<\/p> <\/th> \n   <\/tr> \n  <\/thead> \n  <tbody>\n   <tr>\n    <td valign=\"top\" width=\"NaN%\" headers=\"d17e52145 \"><p>GetHeaderOnly<\/p> <\/td> \n    <td valign=\"top\" width=\"NaN%\" headers=\"d17e52148 \"><p>ANSWERED, CC, DELETED, DRAFT, FLAGGED, FROM, HEADER, LINES, MESSAGEID, MESSAGENUMBER, RECENT, REPLYTO, RXDDATE, SEEN, SENTDATE, SIZE, SUBJECT, TO, UID<\/p> <\/td> \n   <\/tr> \n   <tr>\n    <td valign=\"top\" width=\"NaN%\" headers=\"d17e52145 \"><p>GetAll<\/p> <\/td> \n    <td valign=\"top\" width=\"NaN%\" headers=\"d17e52148 \"><p>ANSWERED, ATTACHMENTFILES, ATTACHMENTS, BODY, CC, CIDS, DELETED, DRAFT, FLAGGED, FROM, HEADER, HTMLBODY, LINES, MESSAGEID, MESSAGENUMBER, RECENT, REPLYTO, RXDDATE, SEEN,SENTDATE, SIZE, SUBJECT, TEXTBODY, TO, UID.<\/p> <p>CID is used to find the correct place of an image in an HTML e-mail message that the CFIMAP tag retrieves. If the e-mail message contains more than one embedded image, only the last embedded image is available.<\/p> <\/td> \n   <\/tr> \n   <tr>\n    <td valign=\"top\" width=\"NaN%\" headers=\"d17e52145 \"><p>ListAllFolders<\/p> <\/td> \n    <td valign=\"top\" width=\"NaN%\" headers=\"d17e52148 \"><p>FULLNAME (specifies the entire directory structure), NAME, NEW, TOTALMESSAGES, and UNREAD<\/p> <\/td> \n   <\/tr> \n  <\/tbody> \n <\/table> \n<\/div><br><div class=\"note\">\n <span class=\"notetitle\">Note: <\/span>The cfimap command works best on IMAP4 revision1. IMAP4 revision1 is backwards compatible with IMAP2 and IMAP2bis versions. Any previous versions are no more actively used. \n<\/div><br>You can get errors in following scenarios:<br><ul>\n <li><p>Accessing an invalid server connection is established. Check the network conditions and whether you are using appropriate server IP address and domain names. Use valid e-mail user names and passwords.<\/p> <\/li> \n <li><p>Accessing non-existent folders: Check whether the folder you are accessing exists. Create or rename folders with valid names. You cannot rename core folders. Move mail within existing folders.<\/p> <\/li> \n <li><p>Slow network: Verify if the timeout attribute needs a higher value. Actions such as CreateFolder may need longer time to execute. In such cases, adjust the value of the timeout attribute.<\/p> <\/li> \n <li><p>Incorrect usage of cfimap attributes: Check if you are using the correct attribute. For example, if you have 15 e-mails in a folder and if the startrow or maxrow attribute has value of 18 then ColdFusion returns an error.<\/p> <\/li> \n <li><p>The e-mail client does not recognize IMAP access. Verify whether your e-mail is set up to allow IMAP access. Complete the necessary IMAP access in connection settings section of your e-mail client.<\/p> <\/li> \n <li><p>Using incorrect syntax for attributes: Verify that all attributes are defined per syntax.<\/p> <\/li> \n<\/ul><br>","Attribute":[{"REQOROPT":"Optional","DESCRIPTION":"Returns the message header information for all retrieved mail. Other values for this attribute are: GetAll: Returns mail. The information includes the message header information, message text, and any attachments. Set the AttachmentPath attribute to retrieve attachments. Delete: Deletes messages from a folder. Open: Initiates an open session or connection with the IMAP server. Close: Terminates the open session or connection with the IMAP server. MarkRead: Marks all messages read from a folder. CreateFolder: Creates a folder in the Mailbox. DeleteFolder: Deletes a folder in the Mailbox. RenameFolder: Renames an existing user-defined folder. ListAllFolders: Displays a list of all existing folders in the mailbox or under the folder name defined by the Folder attribute. MoveMail: Moves mail from one folder to another.","default":"GetHeaderOnly","Attribute":"action"},{"REQOROPT":"Optional for GetAll action","DESCRIPTION":"Specifies the name of the folder where ColdFusion retrieves attachments. If this folder does not exist, ColdFusion creates. If you do not specify the folder, then the attachment is not saved. Note: If you specify a relative path, then attachments are saved in a temporary folder. This folder is same as one returned by the GetTempDirectory function.","default":"","Attribute":"attachmentpath"},{"REQOROPT":"Required for the following actions: Open and Close","DESCRIPTION":"Specifies the variable name for the connection\/session. If the server attribute has an invalid IP address or invalid domain name, then the connection fails and ColdFusion returns an error message.","default":"","Attribute":"Connection"},{"REQOROPT":"Required for the following actions: DeleteFolder, CreateFolder, and RenameFolder Optional for LISTALLFOLDERS, MOVEMAIL, MARKREAD, GETALL, GETHEADERONLY, DELETE.","DESCRIPTION":"For mail actions: Specifies the folder name where messages are retrieved, moved, or deleted. If folder name is invalid, ColdFusion defaults to INBOX. For folder actions: Specifies the folder name that is deleted (DeleteFolder) or created (CreateFolder) or renamed (RenameFolder). When selecting a subfolder, use the period (.) character as appropriate. For example, when deleting mail in folder ‘Module’ in folder ‘Product.Version.Module’, define the Folder attribute as ‘Product.Version.Module’.","default":"INBOX (For ListAllFolders action, the default folder is mailbox)","Attribute":"Folder"},{"REQOROPT":"Optional","DESCRIPTION":"Ensures that unique file names are generated for each attachment file. The goal is to avoid name conflicts for attachments that have the same filename.","default":" ","Attribute":"GenerateUniqueFilenames"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies the number of rows to be marked as read, deleted, or moved across folders. When the value is 1, it signals the row determined by StartRow. Any incremental value marks rows starting from the StartRow.If you have specified the UID or MessageNumber attribute, then MaxRows is ignored.","default":" ","Attribute":"MaxRows"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies the message number or a comma delimited list of message numbers for retrieval, deletion, marking mail as read, or moving mails. If you set an invalid message number, then the IMAP operation is ignored. For example, if you specify that cfimap deletes a specified message number, and if that message number does not exist, then the operation is ignored. If you have specified the UID attribute, then MessageNumber attribute is ignored.","default":" ","Attribute":"MessageNumber"},{"REQOROPT":"Optional Required for the following actions: GetAll, GetHeaderOnly, and ListAllFolders","DESCRIPTION":"Specifies the name for the query object that contains the retrieved message information.","default":" ","Attribute":"Name"},{"REQOROPT":"Optional Required for the following actions: RenameFolder, MoveMail","DESCRIPTION":"Specifies the name of the new folder when you rename a folder or the name of the destination folder where all mails move.","default":" ","Attribute":"NewFolder"},{"REQOROPT":"Optional Required when action=\"open\" username and password must be specified.","DESCRIPTION":"Specifies the password for assessing the users’ e-mail account.","default":" ","Attribute":"Password"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies the IMAP port number. Use 143 for non-secure connections and 993 for secured connections.","default":"143 or 993","Attribute":"Port"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies whether ColdFusion runs the CFIMAP command in subfolders. Recurse works for action=”ListAllFolders”. When recurse is set to ”true”, ColdFusion parses through all folders and subfolders and returns folder\/subfolder names and mail information.","default":false,"Attribute":"Recurse"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies whether the IMAP server uses a Secure Sockets Layer.","default":false,"Attribute":"Secure"},{"REQOROPT":"Optional Required for the Open action","DESCRIPTION":"Specifies the IMAP server identifier. You can assign a host name or an IP address as the IMAP server identifier.","default":" ","Attribute":"Server"},{"REQOROPT":"Optional","DESCRIPTION":"Defines the first row number for reading or deleting. If you have specified the UID or MessageNumber attribute, then StartRow is ignored. You can also specify StartRow for moving mails.","default":" ","Attribute":"StartRow"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies whether to ignore the exceptions for this operation. When the value is true, it stops processing, displays an appropriate error.","default":true,"Attribute":"StopOnError"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies the number of seconds to wait before timing out connection to IMAP server. An error message is displayed when timeout occurs.","default":60,"Attribute":"Timeout"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies the unique ID or a comma-delimited list of Uids to retrieve, delete, and move mails. If you set invalid Uids, then they are ignored.","default":" ","Attribute":"Uid"},{"REQOROPT":"Optional","DESCRIPTION":"Specifies the user name. Typically, the user name is same the e-mail login.","default":" ","Attribute":"Username"}]}