{"HISTORY":"<!-- --><br>ColdFusion MX: Added this function.<br>","SYNTAX":"<!-- --><br>GetPageContext()<br>","CATEGORY":"System functions","PAGENAME":"GetPageContext","SEEALSO":"","DESCRIPTION":"Gets the current ColdFusion PageContext object that provides access to page attributes and configuration, request, and response objects.","LICENCE":"http:\/\/help.adobe.com\/en_US\/ColdFusion\/10.0\/LegalNotices\/index.html","EXAMPLE":"<!-- --><br>&lt;!--- This example shows using the page context to set a page  \r\n    variable and access the language of the current locale. ---&gt; \r\n&lt;cfset pc = GetPageContext()&gt; \r\n \r\n&lt;cfset pc.setAttribute(&quot;name&quot;,&quot;John Doe&quot;)&gt; \r\n&lt;cfoutput&gt;name: #variables.name#&lt;br&gt;&lt;\/cfoutput&gt; \r\n \r\n&lt;cfoutput&gt;Language of the current locale is \r\n    #pc.getRequest().getLocale().getDisplayLanguage()#&lt;\/cfoutput&gt;.<br>","USAGE":"<!-- --><br>The ColdFusion PageContext class is a wrapper class for the Java PageContext object that can resolve scopes and perform case-insensitive variable lookups.<br>The PageContext object exposes fields and methods that can be useful in J2EE integration. It includes the <samp class=\"codeph\">include<\/samp> and <samp class=\"codeph\">forward<\/samp> methods that provide the equivalent of the corresponding standard JSP tags. You use these methods to call JSP pages and servlets. For example, you use the following code in CFScript to include the JSP page hello.jsp and pass it a <samp class=\"codeph\">name<\/samp> parameter:<br>GetPageContext().include(&quot;hello.jsp?name=Bobby&quot;); ===<br>When you use <samp class=\"codeph\">GetPageContext<\/samp> to include a JSP page in a CFML page on WebLogic, you may need to flush the output of the CFML page with <samp class=\"codeph\">cfflush<\/samp> before calling the JSP page. Otherwise, the ColdFusion output appears after the JSP output.<br>The methods supported on the returned PageContext are only the ones mandated by the JSP specification. To look up scopes by name, use the StructGet function, for example:<br>&lt;cfset myscope = &quot;server&quot;&gt; \r\n&lt;cfset myserver = StructGet(myscope)&gt;<br>For more information, see your Java Server Pages (JSP) documentation.<br>On WebLogic, you may need to flush the output of the CFML page (using cfflush) before calling a JSP page. If you do not, the ColdFusion output appears after the JSP output.<br>On JBOSS, if you use this function and you include any JSP file, the content of the JSP file is processed prior to the processing of any CFML tags before the function.<br>","Parameter":[]}